app/controllers/pages_controller.rb

  def step1
    @order = Order.new
  	@serving_styles = ServingStyle.all
---
SELECT "serving_styles".* FROM "serving_styles"

  def update_tea_bases
    # updates tea_bases and tbt based on servingstyle selected
    @serving_style = ServingStyle.find(params[:serving_style_id])
---
SELECT  "serving_styles".* FROM "serving_styles"  WHERE "serving_styles"."id" = ? LIMIT 1  [["id", 1]]

  def update_tea_base_types
    # updates tbt based on teabase selected
    tea_base = TeaBase.find(params[:tea_base_id])
---
SELECT  "tea_bases".* FROM "tea_bases"  WHERE "tea_bases"."id" = ? LIMIT 1  [["id", 1]]

  def step2
  	#@serving_style = params[:serving_style]
  	#@order = Order.new
  	#@order.serving_style = @serving_style
  	#@order.save
  	@flavours = Flavour.all
---
SELECT "flavours".* FROM "flavours"